In [31]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder

In [32]:
path = r'D:\0_Respaldo\0_Proyectos_2024\ML_proyects\KagelX\KaggelX_Challenge\data\transform_data\clean_data.parquet'

In [33]:
data = pd.read_parquet(path)

In [34]:
df =data.copy()

In [35]:
df.head(3)

,id,brand,model_year,milage,fuel_type,engine,transmission,ext_col,int_col,accident,price
0,0,Ford,2018,74349,Gasoline,375.0HP 3.5L V6 Cylinder Engine Gasoline Fuel,10-Speed A/T,Blue,Gray,None reported,11000
1,1,BMW,2007,80000,Gasoline,300.0HP 3.0L Straight 6 Cylinder Engine Gasoli...,6-Speed M/T,Black,Black,None reported,8250
2,2,Jaguar,2009,91491,Gasoline,300.0HP 4.2L 8 Cylinder Engine Gasoline Fuel,6-Speed A/T,Purple,Beige,None reported,15000

### Transformation

In [36]:
label_encoder = LabelEncoder()

In [37]:
df['brand_t'] = label_encoder.fit_transform(df['brand'])
df['fuel_type_t'] = label_encoder.fit_transform(df['fuel_type'])
df['engine_t'] = label_encoder.fit_transform(df['engine'])
df['transmission_t'] = label_encoder.fit_transform(df['transmission'])
df['ext_col_t'] = label_encoder.fit_transform(df['ext_col'])
df['int_col_t'] = label_encoder.fit_transform(df['int_col'])
df['accident_t'] = label_encoder.fit_transform(df['accident'])

In [38]:
df1 = df.copy()

In [39]:
del df1['brand']
del df1['engine']
del df1['transmission']
del df1['ext_col']
del df1['int_col']
del df1['accident']
del df1['fuel_type']
del df1['id']

In [40]:
df1.head(5)

,model_year,milage,price,brand_t,fuel_type_t,engine_t,transmission_t,ext_col_t,int_col_t,accident_t
0,2018,74349,11000,14,2,719,2,26,57,1
1,2007,80000,8250,4,2,534,18,17,9,1
2,2009,91491,15000,21,2,541,14,181,6,1
3,2022,2437,63500,4,3,646,43,100,24,1
4,2001,111000,7850,40,2,219,34,249,9,1

In [41]:
df1.head(5)

,model_year,milage,price,brand_t,fuel_type_t,engine_t,transmission_t,ext_col_t,int_col_t,accident_t
0,2018,74349,11000,14,2,719,2,26,57,1
1,2007,80000,8250,4,2,534,18,17,9,1
2,2009,91491,15000,21,2,541,14,181,6,1
3,2022,2437,63500,4,3,646,43,100,24,1
4,2001,111000,7850,40,2,219,34,249,9,1

In [42]:
path = r'D:\0_Respaldo\0_Proyectos_2024\ML_proyects\KagelX\KaggelX_Challenge\data\transform_data\transform_data.parquet'

In [43]:
df1.to_parquet(path)

### Label encoder export
Exporto el label encoder para utilizarlo despues en el modelo.

In [44]:
import joblib as jb

In [45]:
path = r'D:\0_Respaldo\0_Proyectos_2024\ML_proyects\KagelX\KaggelX_Challenge\data\transform_data\label_encoder.pkl'
jb.dump(label_encoder, path)

['D:\\0_Respaldo\\0_Proyectos_2024\\ML_proyects\\KagelX\\KaggelX_Challenge\\data\\transform_data\\label_encoder.pkl']